{
  "intents": [
    {
      "tag": "cari_rumah",
      "patterns": [
        "Saya ingin rumah di Bogor dengan tanah 120 meter dan 3 kamar",
        "Ada rumah di Bekasi dengan 2 kamar tidur dan luas 100 meter?",
        "Cari rumah di Depok, luas tanah 150, kamar 4",
        "Saya butuh rumah di Tangerang, 3 kamar, tanah 200 meter",
        "Rumah di Jakarta Timur dengan tanah 90 dan 2 kamar",
        "Saya sedang mencari rumah di Bekasi, luas 130 meter, 4 kamar",
        "Bisa carikan rumah di Jakarta Selatan dengan 3 kamar dan tanah 150?",
        "Saya mau lihat rumah di Depok yang punya 2 kamar tidur",
        "Punya listing rumah di Tangerang? Tanahnya sekitar 100m",
        "Tolong tampilkan rumah di Bogor yang luas tanahnya 110m dan ada 3 kamar",
        "Saya cari rumah di Jakarta Barat, tanah 140 meter, 4 kamar",
        "Perlu rumah di Cibubur, 3 kamar, 2 kamar mandi",
        "Bisa bantu cari rumah di Jakarta Utara, 120 meter, 3 kamar?",
        "Saya ingin rumah minimal 3 kamar dan tanah sekitar 100 meter di Bekasi",
        "Rumah 2 kamar tidur dan luas tanah 80 meter di Jakarta Timur"
      ],
      "entities": [
        "city",
        "land_area",
        "bedrooms"
      ]
    },
    {
      "tag": "estimasi_harga",
      "patterns": [
        "Berapa harga rumah dengan 3 kamar dan tanah 100 meter di Jakarta Selatan?",
        "Estimasi harga rumah 2 kamar, tanah 90 meter di Bekasi?",
        "Saya ingin tahu harga rumah dengan luas tanah 150 dan 4 kamar di Depok",
        "Kalau saya punya rumah di Bogor, tanah 120 dan 3 kamar, harganya berapa?",
        "Tolong estimasi harga rumah di Tangerang, luas 130m, 4 kamar",
        "Harga rumah dengan tanah 100 meter dan 2 kamar di Jakarta Pusat?",
        "Perkiraan harga rumah 3 kamar tidur di Bekasi dengan tanah 115m",
        "Berapakah harga rumah di Depok untuk 2 kamar dan tanah 95 meter?",
        "Harga properti dengan 4 kamar dan 160m tanah di Jakarta Barat?",
        "Estimasi nilai rumah dengan spek tanah 140m dan 3 kamar di Bogor"
      ],
      "entities": [
        "city",
        "land_area",
        "bedrooms"
      ]
    },
    {
      "tag": "rata2_harga",
      "patterns": [
        "Berapa rata-rata harga rumah di Bogor?",
        "Harga rumah di Tangerang berapa ya?",
        "Bisa kasih tahu rata-rata harga rumah di Bekasi?",
        "Harga rata-rata rumah di Jakarta Utara?",
        "Saya ingin tahu berapa harga rata-rata rumah di Depok",
        "Berapa estimasi harga rata-rata rumah di Cibubur?",
        "Tolong informasikan harga rumah rata-rata di Jakarta Pusat",
        "Saya ingin tahu kisaran harga rumah di Jakarta Timur",
        "Berapakah harga umum rumah di Tangerang?",
        "Kira-kira harga rumah di Bogor itu berapa rata-ratanya?"
      ],
      "entities": [
        "city"
      ]
    },
    {
      "tag": "keluar",
      "patterns": [
        "keluar",
        "selesai",
        "bye",
        "sampai jumpa",
        "terima kasih, saya selesai",
        "exit",
        "saya sudah cukup",
        "sampai di sini saja",
        "cukup, terima kasih",
        "saya ingin menutup percakapan"
      ],
      "entities": []
    },
    {
      "tag": "fallback",
      "patterns": [
        "Apakah ada rumah untuk investasi?",
        "Saya ingin tanya sesuatu yang lain",
        "Apa rekomendasi terbaik menurutmu?",
        "Kamu bisa bantu renovasi rumah juga?",
        "Boleh tanya hal lain selain harga rumah?",
        "Saya penasaran tentang tren properti",
        "Bagaimana cara mengurus KPR?",
        "Apa saran terbaik untuk beli rumah pertama?",
        "Apakah rumah subsidi tersedia?",
        "Saya mau tanya tapi tidak tahu harus mulai dari mana"
      ],
      "entities": []
    },
    {
      "tag": "cari_spesifikasi_dari_budget",
      "patterns": [
        "Saya punya dana 150 juta",
        "Dengan budget 500 juta saya bisa dapat rumah seperti apa?",
        "Kalau saya punya 300 juta, bisa beli rumah di mana?",
        "Saya ingin beli rumah dengan anggaran 700 juta",
        "Dengan uang 1 miliar saya bisa beli rumah di Bekasi?",
        "Kalau saya punya dana 450 juta, dapat rumah seperti apa di Bogor?",
        "Budget saya cuma 250 juta, rumahnya seperti apa?",
        "Rumah seperti apa yang bisa saya dapatkan dengan uang 600 juta?",
        "Jika dana saya 900 juta, apa yang bisa saya dapatkan di Depok?",
        "Saya hanya punya 200 juta, apakah ada rumah yang cocok?",
        "Bisa kasih pilihan rumah dengan harga 300 juta?",
        "Kalau punya 1.5 miliar, dapat rumah seperti apa di Jakarta Selatan?",
        "Saya tertarik cari rumah di Tangerang, dana saya 400 juta",
        "Saya cari rumah di Jakarta Timur dengan budget 800 juta",
        "Punya referensi rumah dengan harga 350 juta?",
        "Saya hanya punya dana 275 juta, bisa beli rumah di Bekasi?",
        "Kalau saya punya dana 600 juta, seperti apa rumahnya di Bogor?",
        "Rumah harga 700 juta bisa dapat 3 kamar nggak?",
        "Saya ingin tahu rumah seperti apa yang bisa saya beli dengan 950 juta",
        "Saya punya uang 120 juta, apakah ada rumah untuk saya?",
        "Dana saya 2 miliar, bisa dapat rumah seperti apa di Jakarta Barat?",
        "Kalau budget saya 900 juta, rumahnya seperti apa ya?",
        "Saya punya dana terbatas, sekitar 400 juta",
        "Bisa bantu saya cari rumah berdasarkan dana 550 juta?",
        "Saya hanya bisa keluarkan 370 juta, dapat rumah apa?",
        "Apa rumah yang tersedia untuk budget 600 juta di Tangerang?",
        "Saya cari rumah dengan harga maksimal 500 juta",
        "Saya ingin tahu apa saja rumah yang cocok dengan budget 750 juta",
        "Kalau uang saya 850 juta, bisa dapat rumah di Depok?",
        "Saya ingin beli rumah seharga 300 juta",
        "Saya ingin rumah tapi budget saya hanya 100 juta",
        "Kalau saya punya dana 1.2 miliar, rumah apa yang bisa saya dapat?",
        "Tolong bantu cari rumah sesuai dana 950 juta"
      ],
      "entities": [
        "budget",
        "city"
      ]
    }
  ]
}