{
  "intents": [
    {
      "tag": "sapaan",
      "patterns": [
        "halo",
        "hai",
        "assalamualaikum",
        "selamat pagi",
        "selamat siang",
        "selamat malam",
        "halo bot",
        "hai asisten",
        "apa kabar",
        "selamat sore",
        "pagi",
        "siang",
        "malam",
        "yo",
        "hello",
        "hi there",
        "ada orang?",
        "permisi",
        "selamat datang",
        "halo",
        "hi bot",
        "selamat pagi",
        "selamat sore",
        "permisi",
        "ada orang?",
        "pagi bot"
      ],
      "responses": [
        "Halo! Ada yang bisa saya bantu?",
        "Hai! Apa yang bisa saya bantu hari ini?"
      ]
    },
    {
      "tag": "ucapan_terima_kasih",
      "patterns": [
        "terima kasih",
        "makasih",
        "thank you",
        "thx",
        "mantap bot",
        "siip terimakasih",
        "thanks a lot",
        "makasih banyak",
        "terimakasih ya",
        "good job",
        "keren bot",
        "terima kasih banyak",
        "thanks ya",
        "top bot",
        "bagus sekali",
        "appreciate it",
        "terima kasih",
        "makasih ya",
        "sangat membantu",
        "oke terimakasih",
        "thank you"
      ],
      "responses": [
        "Sama-sama!",
        "Senang bisa membantu! Semoga menemukan rumah impian Anda!",
        "Sampai jumpa di pertanyaan berikutnya!"
      ]
    },
    {
      "tag": "cari_rumah",
      "patterns": [
        "saya ingin rumah di bekasi",
        "cari rumah di tangerang luas tanah 100",
        "saya cari rumah di depok, 3 kamar tidur dan 2 kamar mandi",
        "rumah di bogor 80 meter 3 kamar",
        "saya ingin rumah di jakarta timur dengan 4 kamar tidur dan 3 kamar mandi",
        "saya ingin rumah di bogor dengan 3 kamar tidur",
        "rumah di tangerang dengan tanah 120 meter",
        "saya cari rumah 2 lantai di depok",
        "mau rumah di bekasi dengan 4 kamar dan 2 kamar mandi",
        "cari rumah dengan bangunan 100 meter di jakarta timur",
        "rumah dengan 3 kamar tidur dan tanah 80 meter",
        "mencari rumah di cibubur dengan 2 kamar",
        "saya ingin rumah 1 lantai, 3 kamar di bogor",
        "rumah di pondok gede dengan 2 kamar mandi",
        "saya cari rumah di jakarta selatan dengan bangunan 90 meter",
        "ada rumah 4 kamar di tangerang?",
        "saya cari rumah minimal tanah 100 meter dan 3 kamar",
        "saya mau rumah di depok 2 kamar saja cukup",
        "butuh rumah dengan luas bangunan 70 meter dan tanah 120 meter",
        "saya ingin rumah compact di bekasi 2 kamar",
        "ada rumah minimal 3 kamar dan 2 carport?",
        "rumah dengan tanah luas dan 4 kamar tidur",
        "mau rumah yang cocok untuk keluarga besar",
        "saya butuh rumah 2 lantai di area jakarta barat",
        "cari rumah di kawasan asri dan sejuk di bogor",
        "Saya ingin cari rumah di kawasan Bogor",
        "Lagi butuh rumah dengan 2 lantai dan 3 kamar di Depok",
        "Tolong carikan rumah 2 kamar tidur dan 2 kamar mandi",
        "Ada rumah dengan bangunan 90 meter dan tanah 120?",
        "Cari rumah di Tangerang dengan luas tanah 150m2",
        "Saya butuh rumah 3 kamar di daerah Bekasi",
        "Mau rumah di Jakarta Selatan yang minimalis",
        "Cari rumah di kota Depok, budget nanti saya sebutkan",
        "Saya butuh rumah dengan 2 kamar tidur dan 1 garasi",
        "Ada nggak rumah yang tanahnya 100 meter dan 3 kamar?",
        "Saya tertarik cari rumah di sekitar BSD",
        "Lagi cari hunian di Jakarta Barat, syaratnya 2 kamar",
        "Saya ingin rumah di kota besar dengan tanah 150m2",
        "Ada rumah dengan tanah 120 dan 2 lantai?"
      ],
      "responses": [
        "Tentu, saya bantu. Bisa sebutkan luas tanah, jumlah kamar, atau garasi yang diinginkan?"
      ]
    },
    {
      "tag": "tanya_harga",
      "patterns": [
        "berapa harga rumah di bekasi dengan 3 kamar?",
        "rumah 2 kamar di depok biasanya berapa ya?",
        "berapa sih harga rumah di tangerang luas tanah 120?",
        "rumah dengan 4 kamar dan 3 kamar mandi harganya berapa?",
        "kira-kira harga rumah di bogor 2 lantai berapa?",
        "berapa estimasi harga rumah dengan bangunan 100 meter?",
        "rumah di jakarta selatan dengan 3 kamar dan 2 kamar mandi itu berapa?",
        "berapa ya harga rumah tanah 90 meter di bekasi?",
        "saya ingin tahu harga rumah dengan spesifikasi tertentu",
        "berapa perkiraan harga rumah 4 kamar tidur di cibubur?",
        "rumah 3 kamar dengan tanah 100 meter biasanya berapa?",
        "berapa harga rumah di kawasan margonda?",
        "kalau rumah 2 lantai di tangerang kira-kira berapa?",
        "berapa harga pasaran rumah 2 kamar di jakarta?",
        "rumah 1 lantai 3 kamar di depok berapa duitnya?",
        "berapa budget yang perlu disiapkan untuk rumah 120 meter di bogor?",
        "berapa sih harga rumah minimalis dengan 2 kamar?",
        "mau tahu harga rumah keluarga dengan 4 kamar",
        "rumah tipe 45 di bekasi itu biasanya berapa?",
        "harga rumah dengan 3 kamar dan garasi 1 mobil kira-kira?",
        "berapa harga rumah 3 kamar di bekasi?",
        "harga rumah di tangerang dengan 2 kamar dan tanah 100 meter",
        "kalau rumah di bogor 3 kamar, kira-kira berapa?",
        "saya ingin tahu harga rumah dengan tanah 120 meter di jakarta",
        "berapa harga rumah dengan bangunan 90 meter di depok?",
        "Kira-kira berapa harga rumah di daerah BSD?",
        "Berapa sih harga rumah 2 lantai di Depok?",
        "Kalau rumah tanah 120 meter di Jakarta, harganya berapa?",
        "Harga rumah dengan 3 kamar dan 2 kamar mandi di Bekasi?",
        "Berapa estimasi harga rumah di Tangerang Selatan?",
        "Penasaran harga rumah dengan 4 kamar di kota Bogor",
        "Berapa harga rumah sederhana di Jakarta Barat?",
        "Kalau tanahnya 200 meter, rumah harganya kisaran berapa?",
        "Saya mau tahu harga rumah di Cinere",
        "Harga rumah dengan bangunan 90 meter itu berapa ya?",
        "Rumah 2 kamar dan 1 garasi biasanya berapa?",
        "Estimasi harga rumah 100 meter di daerah elit?",
        "Berapa kisaran harga rumah di Jati Asih?",
        "Kalau rumah minimalis di Tangerang, berapa ya?",
        "Berapaan ya harga rumah luas 150 meter di BSD City?"
      ],
      "responses": ["Baik, saya akan bantu hitung estimasi harganya..."]
    },
    {
      "tag": "unknown",
      "patterns": [
        "Apa pendapatmu tentang politik?",
        "Siapa penyanyi favoritmu?",
        "Berapa hasil pertandingan semalam?",
        "Bagaimana cuaca di Jepang?",
        "Apa yang kamu pikirkan tentang film horor?",
        "Siapa tokoh favorit dalam anime?",
        "Apa kamu bisa nyanyi?",
        "Bot, kamu bisa cerita lucu?",
        "Apa ramalan zodiakku hari ini?",
        "Ceritain kisah legenda dong",
        "Siapa presiden Indonesia?",
        "Berapa harga mobil Tesla?",
        "Kapan hari libur nasional?",
        "Apa itu AI?",
        "Siapa yang menciptakan kamu?",
        "Bisakah kamu memesan tiket pesawat?",
        "Berapa harga emas hari ini?",
        "Apa rekomendasi tempat liburan?",
        "Siapa pemain terbaik dunia?",
        "Bagaimana cara membuat kue?",
        "Siapa presiden Indonesia? kok",
        "Bagaimana cara membuat kue? deh",
        "Apa rekomendasi tempat liburan? deh",
        "Kapan hari libur nasional? kok",
        "Kapan hari libur nasional? deh",
        "Siapa presiden Indonesia? ya",
        "Apa itu AI? deh",
        "Apa itu AI? nih",
        "Siapa presiden Indonesia? deh",
        "Berapa harga emas hari ini? deh",
        "Kapan hari libur nasional? ya",
        "Bisakah kamu memesan tiket pesawat? dong",
        "Siapa pemain terbaik dunia? deh",
        "Siapa pemain terbaik dunia? kok",
        "Siapa pemain terbaik dunia? deh",
        "Apa itu AI? ya",
        "Berapa harga mobil Tesla? deh",
        "Kapan hari libur nasional? deh",
        "Bisakah kamu memesan tiket pesawat? kok",
        "Kapan hari libur nasional? dong",
        "saya suka kucing",
        "saya sedang sedih",
        "saya ingin makan sate",
        "cuaca hari ini mendung",
        "musik favorit saya jazz",
        "saya suka hujan dan langit malam"
      ],
      "responses": [
        "Maaf, saya tidak paham maksud Anda. Coba sampaikan kembali dengan kalimat lain ya.",
        "Hmm, saya belum bisa memahami maksud Anda. Bisa dijelaskan ulang?"
      ]
    },
    {
      "tag": "tanya_dari_budget",
      "patterns": [
        "saya punya budget 1,5 miliar",
        "punya 1.2 m, rumahnya seperti apa?",
        "kalau saya hanya punya dana 900 juta, bisa dapat rumah di mana?",
        "budget saya 2 miliar dan ingin rumah di tangerang",
        "rumah apa yang bisa saya dapatkan dengan 1,2 miliar?",
        "saya punya budget 1,5 miliar",
        "punya uang 700 juta, dapat rumah seperti apa?",
        "kalau saya ada 2 miliar, bisa beli rumah di mana?",
        "saya hanya punya 800 juta",
        "dengan modal 1.2 m, saya bisa dapat rumah di mana?",
        "punya dana 500 juta untuk beli rumah",
        "saya bawa uang 1 m, rumah seperti apa yang cocok?",
        "kalau saya punya 1,1 miliar bisa dapat rumah di bekasi?",
        "dengan 950 juta, apa opsi rumahnya?",
        "1.3 miliar cukup untuk rumah di tangerang?",
        "saya punya 1.4 miliar tapi nggak tahu daerahnya",
        "budget saya cuma 600 juta",
        "bisa cariin rumah dengan dana 700 juta?",
        "saya mau beli rumah, uang saya 2 miliar",
        "kalau saya punya 1 juta aja, masih bisa dapet rumah?",
        "budget terbatas, sekitar 900 juta",
        "hanya punya 750 juta, bisa dapet rumah bagus gak?",
        "modal saya 1.5 m, bisa dapet rumah di depok?",
        "punya dana 1 m, tapi bingung cari rumah",
        "kalau 500 juta, dapat rumah di mana?",
        "Kalau saya punya dana 700 juta, bisa beli rumah di mana ya?",
        "Dengan budget 1,3M, rumah seperti apa yang bisa saya dapatkan?",
        "Saya hanya punya 900 juta, ada saran rumah?",
        "Rumah apa yang bisa dibeli dengan uang 1,2 miliar?",
        "1,5M cukup nggak buat beli rumah bagus?",
        "Punya anggaran 800 juta, bisa dapat rumah luas?",
        "Kalau budget saya 2M, daerah mana yang cocok?",
        "Saya ingin rumah yang sesuai dengan budget 500 juta",
        "Cari rumah sesuai dengan dana 1M, bisa?",
        "Uang saya cuma 600 juta, rumah yang cocok?",
        "Budget saya 1 miliar, apa rekomendasinya?",
        "Dengan 950 juta, rumah seperti apa yang tersedia?",
        "Saya punya dana sekitar 1,1M, ada saran rumah?",
        "Jika saya punya 1,8M, rumah apa yang bisa didapat?",
        "Dengan budget 400 juta, ada rumah yang layak?"
      ],
      "responses": [
        "Baik! Saya akan coba cari rumah yang sesuai dengan anggaran Anda...",
        "Mari kita lihat spesifikasi rumah yang cocok dengan budget tersebut."
      ]
    },
    {
      "tag": "not_supported",
      "patterns": [
        "bagaimana cara beli rumah?",
        "apakah saya bisa punya rumah?",
        "saya bingung mulai dari mana",
        "bagaimana proses pembelian rumah?",
        "saya tidak tahu apa itu KPR",
        "apa itu sertifikat rumah?",
        "bisa bantu edukasi soal properti?",
        "saya mau tanya soal pajak rumah",
        "bagaimana cara mengurus KPR?",
        "apa syarat beli rumah pertama?",
        "bisa bantu hitung cicilan rumah?",
        "apa itu AJB?",
        "saya ingin tahu legalitas rumah",
        "apa bedanya rumah SHM dan HGB?",
        "berapa rumah mewah di kemang jakarta selatan?",
        "harga rumah subsidi di tangerang saat ini berapa?",
        "bagaimana cara mengurus KPR?",
        "apa itu AJB?",
        "pajak rumah berapa?",
        "bisa bantu proses notaris?",
        "bisa bantu urus kredit rumah?",
        "apa itu PPJB?",
        "cara proses KPR gimana?",
        "berapa biaya notaris rumah?",
        "butuh bantuan legalitas rumah",
        "bisa bantu urus sertifikat?",
        "apa itu AJB?",
        "proses jual beli rumah itu seperti apa?",
        "apa itu SHM?",
        "bagaimana proses balik nama sertifikat rumah?",
        "bisa bantu hitung cicilan KPR?",
        "apa syarat ambil rumah subsidi?",
        "kapan waktu terbaik beli rumah?",
        "gimana proses jual rumah ke developer?",
        "saya mau tanya tentang biaya pajak rumah",
        "apakah bisa beli rumah tanpa notaris?",
        "saya mau tahu tentang legalitas rumah warisan",
        "apa itu sertifikat HGB dan SHM?",
        "bisa bantu hitung biaya notaris dan BPHTB?"
      ],
      "responses": [
        "Mohon maaf, sistem ini hanya melayani pencarian dan estimasi rumah di wilayah Jabodetabek.",
        "Untuk saat ini, saya belum bisa menjawab pertanyaan di luar estimasi dan pencarian rumah."
      ]
    }
  ]
}
