{
  "intents": [
    {
      "tag": "sapaan",
      "patterns": [
        "halo",
        "hai",
        "assalamualaikum",
        "selamat pagi",
        "selamat siang",
        "selamat malam",
        "halo bot",
        "hai asisten",
        "apa kabar",
        "selamat sore",
        "pagi",
        "siang",
        "malam",
        "yo",
        "hello",
        "hi there",
        "ada orang?",
        "permisi",
        "selamat datang",
        "halo",
        "hi bot",
        "selamat pagi",
        "selamat sore",
        "permisi",
        "ada orang?",
        "pagi bot"
      ],
      "responses": [
        "Halo! Ada yang bisa saya bantu?",
        "Hai! Apa yang bisa saya bantu hari ini?"
      ]
    },
    {
      "tag": "ucapan_terima_kasih",
      "patterns": [
        "terima kasih",
        "makasih",
        "thank you",
        "thx",
        "mantap bot",
        "siip terimakasih",
        "thanks a lot",
        "makasih banyak",
        "terimakasih ya",
        "good job",
        "keren bot",
        "terima kasih banyak",
        "thanks ya",
        "top bot",
        "bagus sekali",
        "appreciate it",
        "terima kasih",
        "makasih ya",
        "sangat membantu",
        "oke terimakasih",
        "thank you"
      ],
      "responses": [
        "Sama-sama!",
        "Senang bisa membantu! Semoga menemukan rumah impian Anda!",
        "Sampai jumpa di pertanyaan berikutnya!"
      ]
    },
    {
      "tag": "cari_rumah",
      "patterns": [
        "saya ingin mencari rumah di bogor",
        "tolong bantu carikan rumah di depok",
        "saya mau beli rumah di jakarta",
        "saya cari rumah di tangerang",
        "ada rumah di bekasi?",
        "bisa bantu cari rumah di jakarta pusat",
        "saya butuh rumah daerah pamulang",
        "carikan rumah di serpong dong",
        "rumah murah di bogor ada?",
        "bisa cari rumah dekat stasiun?",
        "saya sedang cari rumah second di jabodetabek",
        "ada listing rumah di bekasi?",
        "saya ingin mencari rumah di bogor",
        "tolong bantu carikan rumah di depok",
        "saya mau beli rumah di jakarta",
        "saya cari rumah di tangerang",
        "ada rumah di bekasi?",
        "bisa bantu cari rumah di jakarta pusat",
        "saya ingin cari rumah di jakarta pusat",
        "mau beli rumah di bekasi",
        "tolong carikan rumah di bogor 2 lantai",
        "butuh rumah 2 kamar di depok",
        "ada rumah 1 lantai di tangerang?",
        "saya cari rumah di jakarta barat",
        "saya ingin rumah 3 kamar di depok",
        "cari rumah 2 lantai dengan carport di tangerang",
        "mau rumah luas tanah 200 meter di bekasi",
        "butuh rumah 4 kamar dan 2 garasi di bogor",
        "bisa carikan rumah di jakarta utara yang punya 2 lantai?",
        "saya pengen rumah 3 kamar dan 2 kamar mandi",
        "bantu cari rumah di tangerang dengan 2 carport",
        "tolong carikan rumah yang ada garasi di jakarta pusat",
        "saya mau beli rumah 1 lantai di depok",
        "cari rumah 2 kamar dan 1 kamar mandi di bogor",
        "saya ingin mencari rumah 1 lantai di bekasi dengan 2 kamar tidur",
        "tolong bantu cari rumah 2 garasi dan 3 kamar tidur di depok",
        "cari rumah di tangerang yang punya 2 lantai dan 1 carport",
        "saya ingin rumah dengan 4 kamar dan 2 lantai di bogor",
        "bantu saya cari rumah luas tanah 200m dan bangunan 150m di depok",
        "cari rumah di jakarta barat dengan 3 kamar dan 2 kamar mandi",
        "saya butuh rumah 1 garasi dan 2 carport di tangerang",
        "cari rumah dengan luas tanah minimal 100 meter dan ada garasi",
        "saya pengen rumah yang punya 2 lantai dan 3 kamar di bekasi",
        "ada rumah dengan 4 kamar tidur dan 3 kamar mandi di depok?"
      ],
      "responses": [
        "Tentu, saya bantu. Bisa sebutkan luas tanah, jumlah kamar, atau garasi yang diinginkan?"
      ]
    },
    {
      "tag": "tanya_harga",
      "patterns": [
        "berapa harga rumah di depok dengan 2 kamar tidur?",
        "berapa harga rumah di jakarta selatan yang punya garasi?",
        "saya ingin tahu harga rumah di bogor",
        "kisaran harga rumah di tangerang 3 kamar 1 garasi",
        "berapa rumah di bekasi luas 150 meter",
        "harga rumah jakarta timur 2 kamar tidur 1 garasi",
        "harga rumah 3 kamar di jakarta utara?",
        "berapa estimasi harga rumah dengan 100m2 tanah",
        "berapa harga rumah 2 lantai di bogor?",
        "rumah 1 lantai di depok harganya berapa ya?",
        "kisaran harga rumah cluster di cibinong?",
        "berapa harga rumah di bogor luas tanah 100 meter?",
        "berapa harga rumah 3 kamar tidur di depok?",
        "kisaran harga rumah di tangerang yang ada garasi?",
        "harga rumah di bekasi ukuran tanah 90 meter berapa?",
        "berapa harga rumah di jakarta utara yang punya garasi?",
        "harga rumah di jakarta timur 2 kamar tidur?",
        "berapa harga rumah 2 kamar di jakarta barat?",
        "rumah 3 kamar di jakarta pusat harganya berapa?",
        "berapa harga rumah di bogor?",
        "harga rumah 2 kamar 1 garasi di depok?",
        "estimasi rumah luas tanah 150 meter di tangerang",
        "berapa harga rumah dengan 3 kamar tidur dan 2 lantai di bekasi?",
        "kisaran harga rumah dengan 200 m tanah dan 1 garasi di jakarta selatan",
        "harga rumah 1 lantai 3 kamar di jakarta barat",
        "berapa harga rumah dengan luas bangunan 150 meter?",
        "rumah 2 lantai di bekasi harganya berapa?",
        "berapa kisaran harga rumah dengan 3 kamar dan 2 kamar mandi?",
        "harga rumah 180m tanah di jakarta selatan berapa?",
        "rumah 1 lantai, 2 kamar tidur, 1 garasi, harganya berapa?",
        "berapa estimasi rumah dengan luas bangunan 120 dan luas tanah 180?",
        "saya ingin tahu harga rumah 3 kamar, 2 lantai di depok",
        "kisaran harga rumah dengan 1 garasi dan 2 carport di bogor?",
        "rumah dengan 2 lantai dan 4 kamar tidur berapa ya harganya?",
        "berapa harga rumah 150m di tangerang dengan 1 garasi dan 2 kamar?",
        "berapa harga rumah di depok dengan luas tanah 180 dan bangunan 150?",
        "kisaran harga rumah 3 kamar tidur 2 kamar mandi di bogor berapa?",
        "harga rumah 2 lantai di tangerang dengan 1 garasi?",
        "berapa estimasi harga rumah di jakarta selatan yang punya 2 carport?",
        "saya ingin tahu harga rumah 1 lantai dengan luas tanah 100m di bekasi",
        "harga rumah di jakarta pusat 4 kamar dan 2 lantai berapa?",
        "berapa harga rumah di tangerang yang punya 3 kamar dan 1 garasi?",
        "berapa harga rumah dengan luas bangunan 200 meter di depok?",
        "rumah 2 lantai 3 kamar 2 kamar mandi harganya berapa ya di bogor?",
        "berapa kisaran harga rumah 150m² di jakarta utara?"
      ],
      "responses": ["Baik, saya akan bantu hitung estimasi harganya..."]
    },
    {
      "tag": "unknown",
      "patterns": [
        "Apa pendapatmu tentang politik?",
        "Siapa penyanyi favoritmu?",
        "Berapa hasil pertandingan semalam?",
        "Bagaimana cuaca di Jepang?",
        "Apa yang kamu pikirkan tentang film horor?",
        "Siapa tokoh favorit dalam anime?",
        "Apa kamu bisa nyanyi?",
        "Bot, kamu bisa cerita lucu?",
        "Apa ramalan zodiakku hari ini?",
        "Ceritain kisah legenda dong",
        "Siapa presiden Indonesia?",
        "Berapa harga mobil Tesla?",
        "Kapan hari libur nasional?",
        "Apa itu AI?",
        "Siapa yang menciptakan kamu?",
        "Bisakah kamu memesan tiket pesawat?",
        "Berapa harga emas hari ini?",
        "Apa rekomendasi tempat liburan?",
        "Siapa pemain terbaik dunia?",
        "Bagaimana cara membuat kue?",
        "Siapa presiden Indonesia? kok",
        "Bagaimana cara membuat kue? deh",
        "Apa rekomendasi tempat liburan? deh",
        "Kapan hari libur nasional? kok",
        "Kapan hari libur nasional? deh",
        "Siapa presiden Indonesia? ya",
        "Apa itu AI? deh",
        "Apa itu AI? nih",
        "Siapa presiden Indonesia? deh",
        "Berapa harga emas hari ini? deh",
        "Kapan hari libur nasional? ya",
        "Bisakah kamu memesan tiket pesawat? dong",
        "Siapa pemain terbaik dunia? deh",
        "Siapa pemain terbaik dunia? kok",
        "Siapa pemain terbaik dunia? deh",
        "Apa itu AI? ya",
        "Berapa harga mobil Tesla? deh",
        "Kapan hari libur nasional? deh",
        "Bisakah kamu memesan tiket pesawat? kok",
        "Kapan hari libur nasional? dong"
      ],
      "responses": [
        "Maaf, saya tidak paham maksud Anda. Coba sampaikan kembali dengan kalimat lain ya.",
        "Hmm, saya belum bisa memahami maksud Anda. Bisa dijelaskan ulang?"
      ]
    },
    {
      "tag": "tanya_dari_budget",
      "patterns": [
        "saya hanya punya dana 500 juta",
        "saya punya uang 1 miliar, bisa dapat rumah seperti apa?",
        "kalau saya punya 800 juta, rumah seperti apa yang bisa saya beli?",
        "dengan 300 juta saya bisa dapat rumah seperti apa?",
        "kalau dana saya 2M, rumahnya seperti apa?",
        "saya hanya punya uang 100 juta",
        "saya cari rumah di bawah 700 juta",
        "budget saya cuma 400 juta",
        "rumah harga 250 juta ada gak?",
        "kalau punya 1,5M bisa dapat rumah di mana?",
        "ada rumah kisaran 600 juta?",
        "kalau saya punya 500 juta bisa dapat rumah seperti apa?",
        "rumah apa yang bisa saya beli dengan 1 miliar?",
        "saya hanya punya uang 300 juta, bisa dapat rumah?",
        "kalau budget saya 750 juta, rumah seperti apa yang cocok?",
        "rumah apa yang bisa dibeli dengan dana 2M?",
        "saya punya uang 100 juta, masih bisa beli rumah?",
        "dengan 900 juta saya bisa dapat rumah di mana?",
        "apakah bisa beli rumah layak dengan 600 juta?",
        "rumah seperti apa yang sesuai dengan budget 850 juta?",
        "punya dana 1.2 miliar, kira-kira bisa dapat rumah mewah tidak?",
        "saya punya dana 500 juta, bisa dapat rumah seperti apa?",
        "kalau saya punya 1 miliar, dapat rumah seperti apa di bogor?",
        "hanya ada uang 200 juta, bisa beli rumah di mana?",
        "dengan budget 800 juta bisa beli rumah berapa kamar?",
        "uang saya cuma 100 juta, apa bisa beli rumah?",
        "punya 1,5 miliar, rumah seperti apa yang saya dapatkan?",
        "saya punya dana 300 juta, rumah seperti apa yang bisa saya dapatkan?",
        "dengan budget 2 miliar bisa dapat rumah kayak gimana?",
        "kalau uang saya 600 juta, bisa beli rumah di daerah mana?",
        "punya 1 miliar, bisa dapet rumah 3 kamar ga?",
        "dengan 500 juta, rumahnya seperti apa?",
        "rumah seperti apa yang bisa dibeli dengan 900 juta?",
        "kalau saya cuma punya 200 juta bisa dapet rumah di mana ya?",
        "budget saya 750 juta, bisa dapat rumah 2 lantai ga?",
        "bisa beli rumah di jakarta selatan dengan 1,5 miliar?",
        "uang saya 400 juta, dapat rumah ukuran berapa?",
        "kalau saya punya 700 juta bisa beli rumah di mana?",
        "saya cuma punya 1 miliar, dapat rumah apa ya?",
        "budget 400 juta bisa dapat rumah yang seperti apa?",
        "kalau modal 900 juta, rumah seperti apa yang saya dapat?",
        "kalau saya punya 500 juta, rumah dengan luas berapa yang saya dapat?",
        "punya dana 600 juta, rumah 2 kamar masih bisa dapet kah?",
        "bisa gak beli rumah 3 kamar di bogor dengan 800 juta?",
        "uang saya terbatas, cuma 300 juta, ada rekomendasi rumah?",
        "saya ingin rumah tapi dana cuma 250 juta, gimana ya?",
        "kalau cuma punya 1,5 miliar, rumah idealnya kayak apa?"
      ],
      "responses": [
        "Baik! Saya akan coba cari rumah yang sesuai dengan anggaran Anda...",
        "Mari kita lihat spesifikasi rumah yang cocok dengan budget tersebut."
      ]
    },
    {
      "tag": "not_supported",
      "patterns": [
        "bagaimana cara beli rumah?",
        "apakah saya bisa punya rumah?",
        "saya bingung mulai dari mana",
        "bagaimana proses pembelian rumah?",
        "saya tidak tahu apa itu KPR",
        "apa itu sertifikat rumah?",
        "bisa bantu edukasi soal properti?",
        "saya mau tanya soal pajak rumah",
        "bagaimana cara mengurus KPR?",
        "apa syarat beli rumah pertama?",
        "bisa bantu hitung cicilan rumah?",
        "apa itu AJB?",
        "saya ingin tahu legalitas rumah",
        "apa bedanya rumah SHM dan HGB?",
        "berapa rumah mewah di kemang jakarta selatan?",
        "harga rumah subsidi di tangerang saat ini berapa?",
        "bagaimana cara mengurus KPR?",
        "apa itu AJB?",
        "pajak rumah berapa?",
        "bisa bantu proses notaris?",
        "bisa bantu urus kredit rumah?",
        "apa itu PPJB?",
        "cara proses KPR gimana?",
        "berapa biaya notaris rumah?",
        "butuh bantuan legalitas rumah",
        "bisa bantu urus sertifikat?",
        "apa itu AJB?",
        "proses jual beli rumah itu seperti apa?",
        "apa itu SHM?",
        "bagaimana proses balik nama sertifikat rumah?",
        "bisa bantu hitung cicilan KPR?",
        "apa syarat ambil rumah subsidi?",
        "kapan waktu terbaik beli rumah?",
        "gimana proses jual rumah ke developer?",
        "saya mau tanya tentang biaya pajak rumah",
        "apakah bisa beli rumah tanpa notaris?",
        "saya mau tahu tentang legalitas rumah warisan",
        "apa itu sertifikat HGB dan SHM?",
        "bisa bantu hitung biaya notaris dan BPHTB?"
      ],
      "responses": [
        "Mohon maaf, sistem ini hanya melayani pencarian dan estimasi rumah di wilayah Jabodetabek.",
        "Untuk saat ini, saya belum bisa menjawab pertanyaan di luar estimasi dan pencarian rumah."
      ]
    }
  ]
}
